{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [3, 3, 3, 16], "dtype": "float32", "name": "conv2d_1/kernel"}, {"shape": [16], "dtype": "float32", "name": "conv2d_1/bias"}, {"shape": [3, 3, 16, 64], "dtype": "float32", "name": "conv2d_2/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_2/bias"}, {"shape": [3, 3, 64, 64], "dtype": "float32", "name": "conv2d_3/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_3/bias"}, {"shape": [256, 256], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [256], "dtype": "float32", "name": "dense_1/bias"}, {"shape": [256, 6], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [6], "dtype": "float32", "name": "dense_2/bias"}]}], "generatedBy": "keras v2.1.3", "modelTopology": {"keras_version": "2.1.3", "model_config": {"config": [{"config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "conv2d_1", "dtype": "float32", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "bias_regularizer": null, "batch_input_shape": [null, 28, 28, 3], "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "padding": "valid", "name": "conv2d_2", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_constraint": null, "padding": "valid", "name": "conv2d_3", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_3", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "units": 256}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_4", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_constraint": null, "name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "units": 6}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"loss_weights": null, "metrics": ["accuracy"], "sample_weight_mode": null, "loss": "binary_crossentropy", "optimizer_config": {"config": {"amsgrad": false, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "decay": 0.0}, "class_name": "Adam"}}, "backend": "tensorflow"}, "convertedBy": "TensorFlow.js Converter v1.2.2.1", "format": "layers-model"}